{ "resume" : {

	"jobs" : [{

		"jobTitle" : "Apprentice",
		"company" : "Perpetual Education",
		"city" : "Los Angeles, CA",
		"startDate" : "February 2022",
		"endDate" : "present",
		"description": "Design for the Web is a course focused on providing an in-depth, challenging, and holistic approach to teaching all aspects of the web design process.  During this course, we have honed our skills in HTML, CSS, PHP and JavaScript, always putting user experience and ease of access at the forefront of our work; understood time management, team building, and content strategy to be essential to the overall success of any project; and engaged in weekly, intense projects that continuously integrate all of our skills and push us to the next level of understanding and personal achievement."
		},

		{
		"jobTitle" : "Principal",
		"company" : "Ninja Strings",
		"city" : "Richmond, VA",
		"startDate" : "April 2013",
		"endDate" : "present",
		"description": "I lead operations, finance and sales for a booking agency for musicians in central Virginia. We were engaged by the Virginia Museum of History and Culture in 2020 to provide music for the opening gala of their exhibit 'Agents of Change: Female Activism in Virginia'. I single-handedly grew the business from its inception to generate $33k of revenue in 2021"
		},

		{
		"jobTitle" : "Director of String Orchestras",
		"company" : "Elko Middle School",
		"city" : "Henrico, VA",
		"startDate" : "October 2013",
		"endDate" : "May 2021",
		"description": "I assumed responsibility for the school's strings program. I introduced my students to the fundamentals of string technique, taught them practice methods they could use use away from the classroom, and prepared them for two live concert performances per year as well as a graded county-wide assessment in the spring."
		},

		{
		"jobTitle" : "Inbound Support Services Representative",
		"company" : "Amazon.com, Inc.",
		"city" : "Richmond, VA / Chester, VA",
		"startDate" : "October 2013",
		"endDate" : "May 2021",
		"description": "My team communicated with catalog and seller support staff throughout the company to fulfill vendor and customer requests for photo or dimensional updates of items, item pricing changes, and detection and removal of third-party 'knockoff' items in the warehouse. We were the last line of defense against all problems found in inbound inventory; we focused on FIFO methodology and prioritized the removal of items that required multiple ISS reps."
		},

		{
		"jobTitle" : "Graduate Teaching Assistant",
		"company" : "University of New Mexico",
		"city" : "Albuquerque, NM",
		"startDate" : "August 2008",
		"endDate" : "May 2009",
		"description": "I led the cello section of the Univeristy Symphony Orchestra and was cellist in the Abe Franck quartet, a fellowship quartet composed of graduate-level musicians. I won the school's 2009 concerto competition."
		}],

	"education" : [{

		"name" : "Perpetual Education",
		"awarded" : "Currently enrolled",
		"startDate" : "February 2022",
		"endDate" : "present"
		},

		{
		"name" : "University of New Mexico",
		"awarded" : "",
		"startDate" : "August 2008",
		"endDate" : "May 2009"
		},

		{
		"name" : "Florida State University",
		"awarded" : "Bachelor of Music, Cello Performance",
		"startDate" : "August 2008",
		"endDate" : "May 2009"
		}],

	"certs" : [{

		"name" : "AWS Certified Cloud Practitioner",
		"awarded" : "July 2021"
		},

		{
		"name" : "Astronomer Certification for Apache Airflow Fundamentals",
		"awarded" : "August 2021"
		}]
	}
}
