{
	"route63cda135d4d4c":
	{
		"type": "interstate",
		"number": "85",
		"name": "Interstate 85",
		"length": "67",
		"startLocation": "67",
		"endLocation": "67",
		"description": "Interstate 85 (I-85) is a major Interstate Highway in the Southeastern United States. Its southern terminus is at an interchange with I-65 in Montgomery, Alabama; its northern terminus is an interchange with I-95 in Petersburg, Virginia, near Richmond. It is nominally north–south as it carries an odd number, but it is physically oriented northeast–southwest and covers a larger east-west span than north-south. While most Interstates that end in a \"5\" are cross-country, I-85 is primarily a regional route serving five southeastern states: Virginia, North Carolina, South Carolina, Georgia, and Alabama.",
		"image": "images/I-85.svg"
	},
	"route63cda5767f240":
	{
		"type": "state-route",
		"number": "522",
		"name": "State Route 522",
		"length": "344",
		"startLocation": "West VIrginia",
		"endLocation": "update",
		"description": "U.S. Route 522 (US 522) is a spur route of US 22 in the states of Virginia, West Virginia, Maryland, and Pennsylvania. The U.S. Highway travels in a north-south direction, and runs 308.59 miles (496.63 km) from US 60 near Powhatan, Virginia, to its northern terminus at US 11 and US 15 near Selinsgrove, Pennsylvania. US 522 serves many small cities and towns in the Piedmont, Blue Ridge Mountains, and northern Shenandoah Valley of Virginia. The highway serves the Virginia communities of Goochland, Mineral, Culpeper, the town of Washington, and Front Royal and the independent city of Winchester. US 522 then follows the Ridge-and-Valley Appalachians north and then east through the Eastern Panhandle of West Virginia, a 2-mile-wide (3.2 km) stretch of Western Maryland, and South Central Pennsylvania to its terminus in the Susquehanna Valley. The highway serves Berkeley Springs, West Virginia; Hancock, Maryland; and the Pennsylvania communities of McConnellsburg, Mount Union, Lewistown, and Middleburg.",
		"image": "images/US-522.svg"
	},
	"route63cf41a8c99a7":
	{
		"type": "state-route",
		"number": "208",
		"name": "State Route 208",
		"length": "85",
		"startLocation": "Ferncliff",
		"endLocation": "Fredericksburg",
		"description": "yokel",
		"image": "images/VA-208.svg"
	}
}