[
    {
        "heading": "Daily action items",
        "goals": [
            "Start daily work early in the day (before 9 a.m.)",
            "Have specific tasks for each day of the week (i.e. write a blogpost, add a module to the CSS garden)",
            "Make time for daily layout practice"
        ]
    },
    {
        "heading": "1-Month Plan",
        "goals": [
            "Obtain a level of comfort with JavaScript equal to that which I have with PHP",
            "Demonstrated improvement in CSS skills, layout implementation, and dynamic data population",
            "Work more with Affinity Designer's tools and try more complex uses of the Pen Tool"
        ]
    },
    {
        "heading": "2-Month Plan",
        "goals": [
            "Be ready for the job market with a comprehensive personal site and a portfolio of class projects and case studies, with a high probability of being extended a job offer",
            "Have a clear idea of what roles I am best suited for in the current job market",
            "Be working on at least one client project with stakeholders",
            "Have practice with mock interviews, code pairing and speedruns to prepare for in-person job interviews",
            "Have a solid record of communication and collaboration on GitHub (regular commits of or contributions to projects), Discord, Reddit, et al."
        ]
    },
    {
        "heading": "6-Month Plan",
        "goals": [
            "Be on the job with entry-level contract work and/or an apprenticeship or internship that has a minimum compensation of $70k or equivalent and allows for continued in-depth practice of HTML, CSS, PHP and JavaScript via web design / implementation projects"
        ]
    },
    {
        "heading": "1-Year Plan",
        "goals": [
            "Be working on more advanced projects requiring specialized knowledge with minimum compensation of $80 - 90k or equivalent",
            "Have a solid pool of resources - colleagues, discussion groups, Discord channels - to consult for any technical issues encountered in my work environment"
        ]
    },
    {
        "heading": "5-Year Plan",
        "goals": [
            "Be financially secure, living in a tiny house deep in the woods with a garden. I want the option to work remotely and to be able to travel at any time.  I want to have developed a reputation as a talented and reliable developer, with a strong client and networking base and a consistent stream of either contract or consulting work with $150k+ compensation annually."
        ]
    }
]