[
	{
		"slug": "theme-challenge",
		"siteXtensionType": "php",
		"title": "outer banks vacation rentals",
		"subtitle": "Theming, CSS frameworks, and replication.",
		"htmlContent": [
			{
				"tag": "p",
				"content": "Each student in the Design for the Web course recently completed a week-long \"responsive theme challenge\"."
			},
			{
				"tag": "p",
				"content": "This project tied together many elements we'd been studying in the course up to this point:"
			},
			{
				"tag": "ul",
				"content": [
					{
						"tag": "li",
						"content": "HTML structure; the \"hierarchy\" of elements;"
					},
					{
						"tag": "li",
						"content": "CSS - work with responsive elements, section spacing, color choices, typography, and making a \"unified whole\" or \"unified statement\""
					},
					{
						"tag": "li",
						"content": "PHP - creating associative arrays and pulling the data to be used for dynamic content (section) creation"
					},
					{
						"tag": "li",
						"content": "Time was a factor; we were given six days to complete the project."
					}
				]
			},
			{
				"tag": "h3",
				"content": "Day 1"
			},
			{
				"tag": "p",
				"content": "As an individual exercise both in in site layout and getting familiar with the tools and languages to be used in the project, each student wrote out all of the code needed to recreate a sample responsive layout as accurately as possible."
			},
			{
				"tag": "h3",
				"content": "Day 2"
			},
			{
				"tag": "p",
				"content": "We reviewed the code from this initial exercise with the instructor to check for understanding and accuracy."
			},
			{
				"tag": "h3",
				"content": "Day 3"
			},
			{
				"tag": "p",
				"content": "We chose an industry or \"niche\" to research. The idea was to gather in one place as many visual tricks and layout elements that were common to all of the sites researched. What colors / color schemes were favored the most? Font pairings? How was spacing used throughout the site? Was there enough between the elements, or were things packed too closely together, like sardines?"
			},
			{
				"tag": "p",
				"content": "It also became apparent during this step that one had to ask the question, “What’s the best way to do research for a project like this?” It had to fall in line with the time constraints we had — at this point we could reasonably expect to have three days maximum to write out the code for the site after the research."
			},
			{
				"tag": "p",
				"content": "My initial thought process for the research went something like this: Treat it like a spree. I chose half a dozen websites and grabbed everything I could off of them as quickly as I could."
			},
			{
				"tag": "p",
				"content": "I began by looking up rental agency websites in a familiar location - the Outer Banks of North Carolina, a popular resort area in the Mid-Atlantic region."
			},
			{
				"tag": "p",
				"content": "I took note of the colors used -- shades of green and blue took center stage on nearly every page, followed by tan and white. It fit the sites' goal of evoking a \"beach\" vibe."
			},
			{
				"tag": "figcaption",
				"content": "One of the sites researched - Sun Realty, Outer Banks, NC"
			},
			{
				"tag": "p",
				"content": "Beach landscape photographs were used as a backdrop for header text on every site I visited. Some websites immediately showed a date/time/number of guests component right off the bat (\"Choose your destination\"); users were able to cut down on their browsing time by being given back only the available results within their specified time period."
			},
			{
				"tag": "p",
				"content": "For all of the sites, further down, a module showed \"categories\" of rentals to choose from (\"Oceanside Rentals\", \"Last Minute Deals\", etc)."
			},
			{
				"tag": "p",
				"content": "After the initial passes on the chosen websites I read a little on font pairings and dug into Google Fonts to find some typefaces that might fit my chosen theme."
			},
			{
				"tag": "p",
				"content": "All of this research prepared us for the following day — the style tile."
			},
			{
				"tag": "h3",
				"content": "Day 4"
			},
			{
				"tag": "p",
				"content": "A style tile is a visual device used in project management and implementation to convey ideas about theming, layout and typography to a stakeholder."
			},
			{
				"tag": "p",
				"content": "Our goal was to take all of the ideas found in the research and mock up a style tile as a prelude to the actual implementation of the code."
			},
			{
				"tag": "p",
				"content": "Getting all of the elements into a presentable \"layout\" format was less important at this stage to me than getting a cohesive feeling about the elements going. The colors, the fonts, the shapes — all of it needed to convey what all of us can probably collectively agree can be called “the beach vibe”. Relaxed. Free. Calming. A piña colada."
			},
			{
				"tag": "p",
				"content": "Two color palettes to be used with site elements, header fonts, and fonts used for paragraph text were included."
			},
			{
				"tag": "h3",
				"content": "Days 5 and 6"
			},
			{
				"tag": "p",
				"content": "It was time to get the code rolling — to use our tools, research and visual devices to make the final layout as close as possible to the sites we had researched."
			},
			{
				"tag": "h3",
				"content": "The first pass"
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			},
			{
				"tag": "",
				"content": ""
			}
		]
	}
]