[
	{
		"slug": "theme-challenge",
		"siteXtensionType": "php",
		"title": "outer banks vacation rentals",
		"subtitle": "Theming, CSS frameworks, and replication.",
		"htmlContent": [
			{
				"tag": "p",
				"content": "Each student in the Design for the Web course recently completed a week-long \"responsive theme challenge\"."
			},
			{
				"tag": "p",
				"content": "This project tied together many elements we'd been studying in the course up to this point:"
			},
			{
				"tag": "ul",
				"content": [
					{
						"tag": "li",
						"content": "HTML structure; the \"hierarchy\" of elements;"
					},
					{
						"tag": "li",
						"content": "CSS - work with responsive elements, section spacing, color choices, typography, and making a \"unified whole\" or \"unified statement\""
					},
					{
						"tag": "li",
						"content": "PHP - creating associative arrays and pulling the data to be used for dynamic content (section) creation"
					},
					{
						"tag": "li",
						"content": "Time was a factor; we were given six days to complete the project."
					}
				]
			},
			{
				"tag": "h3",
				"content": "Day 1"
			},
			{
				"tag": "p",
				"content": "As an individual exercise both in in site layout and getting familiar with the tools and languages to be used in the project, each student wrote out all of the code needed to recreate a sample responsive layout as accurately as possible."
			},
			{
				"tag": "h3",
				"content": "Day 2"
			},
			{
				"tag": "p",
				"content": "We reviewed the code from this initial exercise with the instructor to check for understanding and accuracy."
			},
			{
				"tag": "h3",
				"content": "Day 3"
			},
			{
				"tag": "p",
				"content": "We chose an industry or \"niche\" to research. The idea was to gather in one place as many visual tricks and layout elements that were common to all of the sites researched. What colors / color schemes were favored the most? Font pairings? How was spacing used throughout the site? Was there enough between the elements, or were things packed too closely together, like sardines?"
			},
			{
				"tag": "p",
				"content": "It also became apparent during this step that one had to ask the question, “What’s the best way to do research for a project like this?” It had to fall in line with the time constraints we had — at this point we could reasonably expect to have three days maximum to write out the code for the site after the research."
			},
			{
				"tag": "p",
				"content": "My initial thought process for the research went something like this: Treat it like a spree. I chose half a dozen websites and grabbed everything I could off of them as quickly as I could."
			},
			{
				"tag": "p",
				"content": "I began by looking up rental agency websites in a familiar location - the Outer Banks of North Carolina, a popular resort area in the Mid-Atlantic region."
			},
			{
				"tag": "p",
				"content": "I took note of the colors used -- shades of green and blue took center stage on nearly every page, followed by tan and white. It fit the sites' goal of evoking a \"beach\" vibe."
			},
			{
				"tag": "picture",
				"src": "data/case-studies/outer-banks/sun-realty.jpeg",
				"figcaption": "One of the sites researched - Sun Realty, Outer Banks, NC"
			},
			{
				"tag": "p",
				"content": "Beach landscape photographs were used as a backdrop for header text on every site I visited. Some websites immediately showed a date/time/number of guests component right off the bat (\"Choose your destination\"); users were able to cut down on their browsing time by being given back only the available results within their specified time period."
			},
			{
				"tag": "p",
				"content": "For all of the sites, further down, a module showed \"categories\" of rentals to choose from (\"Oceanside Rentals\", \"Last Minute Deals\", etc)."
			},
			{
				"tag": "picture",
				"src": "data/case-studies/outer-banks/rental-searches.webp",
				"figcaption": false
			},
			{
				"tag": "p",
				"content": "After the initial passes on the chosen websites I read a little on font pairings and dug into Google Fonts to find some typefaces that might fit my chosen theme."
			},
			{
				"tag": "p",
				"content": "All of this research prepared us for the following day — the style tile."
			},
			{
				"tag": "h3",
				"content": "Day 4"
			},
			{
				"tag": "p",
				"content": "A style tile is a visual device used in project management and implementation to convey ideas about theming, layout and typography to a stakeholder."
			},
			{
				"tag": "p",
				"content": "Our goal was to take all of the ideas found in the research and mock up a style tile as a prelude to the actual implementation of the code."
			},
			{
				"tag": "p",
				"content": "Getting all of the elements into a presentable \"layout\" format was less important at this stage to me than getting a cohesive feeling about the elements going. The colors, the fonts, the shapes — all of it needed to convey what all of us can probably collectively agree can be called “the beach vibe”. Relaxed. Free. Calming. A piña colada."
			},
			{
				"tag": "p",
				"content": "Two color palettes to be used with site elements, header fonts, and fonts used for paragraph text were included."
			},
			{
				"tag": "picture",
				"src": "data/case-studies/outer-banks/style-tile.webp",
				"figcaption": ""
			},
			{
				"tag": "h3",
				"content": "Days 5 and 6"
			},
			{
				"tag": "p",
				"content": "It was time to get the code rolling — to use our tools, research and visual devices to make the final layout as close as possible to the sites we had researched."
			},
			{
				"tag": "h3",
				"content": "The first pass"
			},
			{
				"tag": "picture",
				"src": "data/case-studies/outer-banks/figure-1.webp",
				"figcaption": "Figure 1.1"
			},
			{
				"tag": "picture",
				"src": "data/case-studies/outer-banks/figure-2.webp",
				"figcaption": "Figure 1.2"
			},
			{
				"tag": "picture",
				"src": "data/case-studies/outer-banks/figure-3.webp",
				"figcaption": "Figure 1.3"
			},
			{
				"tag": "p",
				"content": "The first phase. I’d just placed the photos and new fonts into the layout and incorporated some color choices. Immediate issues included getting the first page-wide image to not repeat — and for it to be centered. The spacing in the first section hadn’t been worked out yet, but user feedback told me there wasn’t enough space between the image and the first bit of text content. (fig. 1)."
			},
			{
				"tag": "p",
				"content": "Our site template included an <code>&lt;article&gt;</code> section. The PHP element of the project came into play here — data from an associative array was used to populate each of the <code>&lt;article-card&gt;</code> elements. I didn’t change too much about the initial card styling on the first pass, but added images and the chosen heading and “normal text” fonts (fig. 2)."
			},
			{
				"tag": "p",
				"content": "The module in fig. 3 is a module of the same type as the bottom half of fig. 1. It mostly served to test out which color was the most effective for the space."
			},
			{
				"tag": "h3",
				"content": "The second pass"
			},
			{
				"tag": "picture",
				"src": "data/case-studies/outer-banks/figure-4.webp",
				"figcaption": "Figure 1.4"
			},
			{
				"tag": "p",
				"content": "From a spacing standpoint, it’s an improvement from the first pass. User feedback about the legibility (or lack thereof) of the heading font led me to try another one."
			},
			{
				"tag": "picture",
				"src": "data/case-studies/outer-banks/figure-5.jpeg",
				"figcaption": "Figure 1.5"
			},
			{
				"tag": "p",
				"content": "I worked up the cards a good bit for this pass. I added box-shadow to the edges of each card and used an orange-black color scheme for the headings and text to reflect how this info appeared on one of the researched sites."
			},
			{
				"tag": "p",
				"content": "I removed the padding from the <code>&lt;img&gt;</code> elements to allow them to fill the card. <code>align-items: flex-start</code> had been applied to the <text-content> element inside the card; I removed this to allow the button to expand out across the card (fig. 5). I reorganized the code to keep the default stylings for each “type” of module in their respective stylesheets — NOT the general “site.css” file."
			},
			{
				"tag": "h3",
				"content": "Final iteration"
			},
			{
				"tag": "p",
				"content": "I had a few tasks I wanted to check off for the home stretch. First — double- and triple-check and make sure the site looks good on a small screen. (Could the spacing between the top navbar and the button below it in the first section look a little more harmonious even now?)"
			},
			{
				"tag": "picture",
				"src": "data/case-studies/outer-banks/figure-6.webp"
			},
			{
				"tag": "p",
				"content": "I realized after looking at the sites I had researched that virtually all of them included a backdrop of a beachscape as the primary “attention-getter” on their landing pages. So — I made the change and put it into my layout."
			},
			{
				"tag": "picture",
				"src": "data/case-studies/outer-banks/figure-7.jpeg"
			},
			{
				"tag": "p",
				"content": "I created a custom logo for this final pass and incorporated it into the header and footer. I did what I could to address all of the clear spacing issues in this round; adding the <code>vw</code> and <code>vh</code> element to some elements got me the consistency in spacing across screen sizes that I was looking for."
			},
			{
				"tag": "p",
				"content": "I found a nice technique to work with a background image's opacity without affecting the overlaying text — critical for the success of the dark version..."
			},
			{
				"tag": "p",
				"content": "In this technique, the gradient \"transitions\" between two separate translucent \"filters\". Unlike the normal opacity property, it doesn’t effect the child elements."
			},
			{
				"tag": "picture",
				"src": "data/case-studies/outer-banks/figure-8.jpeg"
			},
			{
				"tag": "h3",
				"content": "Conclusion"
			},
			{
				"tag": "p",
				"content": "I learned a great deal about code organization from this project. Placing typographical elements in the correct places is of paramount importance when websites grow to have dozens of modules and hundreds, if not thousands, of components across multiple pages. Certain practices such as putting “one-off” changes in a broadly defined “site.css” file were helpful in keeping the default module stylings “clean” and ready to be used again for another purpose if needed."
			},
			{
				"tag": "p",
				"content": "Later, I received feedback about visualizing and working with a grid layout from the start, among other things, and I'm looking forward to implementing these suggestions in my next project."
			},
			{
				"tag": "p",
				"content": "For the next iteration of this project I want to think more deeply about user experience from the very outset. I will treat feedback as the most valuable form of information I can get about my work after its completion."
			},
			{
				"tag": "p",
				"content": "Key concepts for a successful user experience:"
			},
			{
				"tag": "ul",
				"content": [
					{
						"tag": "li",
						"content": "<em>Legibility.</em> If they can’t read it, they can’t use it."
					},
					{
						"tag": "li",
						"content": "<em>Where are you leading the eye? / The emotional response comes from more than the text.</em> How is everything on the page working together to lead the user to have the kind of experience you want them to have (or lead them to the type of information they’re looking for — or deliver the kind of feedback YOU’RE looking for)?"
					}
				]
			},
			{
				"tag": "p",
				"content": "My classmates created some really impressive work for this past project. It was inspiring to see, and it’s spurred me on to dig much deeper into the entire front-end toolkit."
			},
			{
				"tag": "p",
				"content": "Improvement comes through PRACTICE. I’m looking forward to doing much, much more of it."
			}
		]
	}
]