[
	{
		"slug": "that-food-truck",
		"siteXtensionType": "html",
		"header": "that food truck",
		"copy": "Creating a minimalist web presence for a client.",
		"sections": [
			{
				"moduleType": "subheader-and-text",
				"header": "Description",
				"copy": [
					"The client needed a simple landing page with a description of their business and contact information.  The project reflects my understanding of HTML after about a month and a half of study."
				]
			},
			{
				"moduleType": "subheader-figure-caption",
				"image-header": "Here's an example image",
				"image": "images/los-angeles-skyline.jpeg",
				"alt": "Los Angeles skyline",
				"figcaption": "I used this background photo on the site landing to convey a feeling of excitement in an urban setting."
			},
			{
				"moduleType": "subheader-and-text",
				"header": "Summary",
				"copy": [
					"This project forced us into the arenas of content strategy, client relations, and foundational user experience."
				]
			}
		]
	},
	{
		"slug": "responsive-layout-challenge",
		"siteXtensionType": "html",
		"header": "responsive layout challenge",
		"copy": "Bringing together the foundational elements of responsive layouts.",
		"sections": [
			{
				"moduleType": "subheader-and-text",
				"header": "Research",
				"copy": [
					"At this point in the Design for the Web course we had spoken a lot about responsive web design.  What elements make a site successfully responsive?  How can a designer take a site from breakpoint to breakpoint in a way that keeps the content at the center of the user experience?  With this project we aimed to coalesce our understanding of these elements into a single-page showcase."
				]
			},
			{
				"moduleType": "subheader-figure-caption",
				"image-header": "Here's an example image",
				"image": "images/saigon-skyline.jpeg",
				"alt": "Saigon skyline"
			}
		]
	},
	{
		"slug": "theme-challenge",
		"siteXtensionType": "php",
		"header": "outer banks vacation rentals",
		"copy": "Theming, CSS frameworks, and replication.",
		"sections": [
			{
				"moduleType": "subheader-and-text",
				"header": "Description",
				"copy": [
					"For this project we were provided a CSS framework.  We were to choose a theme that a business or other entity could use and build out a site using only the elements in that framework."
				]
			},
			{
				"moduleType": "subheader-figure-caption",
				"image-header": "Here's an example image",
				"image": "images/shoreline-2.jpeg",
				"alt": "Picture of a shoreline",
				"figcaption": "We edited the CSS styling with minimal, if any, changes to the HTML to achieve the theme."
			},
			{
				"moduleType": "subheader-and-text",
				"header": "Conclusion",
				"copy": [
					"CSS frameworks offer a great deal of freedom even if it doesn't appear so at first. The more vanilla code a developer knows and can utilize, the more personalized they can make their projects.  In general, it appears that certain structural components such as headers and footers can have a definite appearance in a framework, relieving the developer of the need to design and position these elements."
				]
			}
		]
	},
	{
		"slug": "highwaysofvirginia",
		"siteXtensionType": "php",
		"header": "highways of virginia",
		"copy": "Dynamically creating pages with PHP scripts.  Full CRUD (create-read-updae-delete functionality).",
		"sections": [
			{
				"moduleType": "subheader-and-text",
				"header": "Description",
				"copy": [
					"At this point in the course we had been working with PHP for some time.  The goal here was to create a site that demonstrated knowledge of GET and POST requests and how forms add dynamic functionality to a page by allowing a user to make and receive these requests."
				]
			},
			{
				"moduleType": "subheader-figure-caption",
				"image-header": "Here's an example image",
				"image": "images/i-95.jpeg",
				"alt": "Interstate 95",
				"figcaption": "The site allows the user to view, enter, update, and delete data for roads and highways in the state of Virginia."
			},
			{
				"moduleType": "subheader-and-text",
				"header": "Conclusion",
				"copy": [
					"I dove deep with this project and gained a great deal of confidence with PHP. Reading the documentation was essential to making critical choices and eliminating non-working solutions for this project."
				]
			}
		]
	}
]